IDEA Open Model
BeamData Properties
The BeamData type exposes the following members.
Properties
Name | Description
AddedMember
 Added member
CrossSectionType
 Type of cross section
Cuts
 Cuts on the beam
Id
 Id of the beam
IsAdded
 Is addes beam
MirrorY
 Mirro by Y
MPRLName
 MPRL name of beam
Name
 Name of the beam
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
Plates
 Plates of the beam
Top
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace